Repository: Picmip/l10n
Catalog: *.po
Languages: ro

source: MM Login: Password error
ro: Autentificare MM: Eroare parolă

source: MM Login: Can't login to MM while connected to server
ro: Autentificare MM: nu te poţi autentifica de la serviciul MM când te afli pe un server

source: Frags
ro: Frag-uri

source: MM Login: authentication timeout
ro: Autentificare MM: sesiunea a expirat

source: MM Logout: not logged in
ro: Deconectare MM: nu eşti autentificat

source: MM Logout: can't logout from MM while connected to server
ro: Deconectare MM: nu te poţi deconecta de la serviciul MM când te afli pe un server

source: MM Logout: Failed to force logout
ro: Deconectare MM: deconectarea nu a putut fi forţată

source: MM Login: StatQuery error
ro: Autentificare MM: eroare StatQuery

source: MM Login: Failed, no session id
ro: Autentificare MM: eroare, nu există ID pentru sesiune

source: MM Login: Failed to parse data at step %d
ro: Autentificare MM: nu au putut fi procesate datele la pasul %d

source: %s or %s
ro: %s sau %s

source: yes
ro: da

source: no
ro: nu

source: Machinegun
ro: Mitralieră

source: Riotgun
ro: Puşcă

source: Grenade Launcher
ro: Lansator de grenade

source: Rocket Launcher
ro: Lansator de rachete

source: Plasmagun
ro: Tun cu plasmă

source: Lasergun
ro: Tun laser

source: Cells
ro: Baterii

source: Shells
ro: Proiectile

source: Bullets
ro: Gloanţe

source: Grenades
ro: Grenade

source: Rockets
ro: Rachete

source: Plasma
ro: Plasmă

source: Lasers
ro: Lasere

source: Bolts
ro: Fulgere

source: Blades
ro: Lame

source: Weak bullets
ro: Gloanţe inferioare

source: Weak Shells
ro: Poriectile inferioare

source: Weak Grenades
ro: Grenade inferioare

source: Weak Rockets
ro: Rachete inferioare

source: Weak Plasma
ro: Plasmă inferioară

source: Weak Lasers
ro: Lasere inferioare

source: Weak Bolts
ro: Fulgere inferioare

source: Weak Instas
ro: Instas inferioare

source: Green Armor
ro: Armură verde

source: Yellow Armor
ro: Armură galbenă

source: Red Armor
ro: Armură roşie

source: Armor Shard
ro: Fragment armură

source: 5 Health
ro: 5 Viaţă

source: 25 Health
ro: 25 Viaţă

source: 50 Health
ro: 50 Viaţă

source: Mega Health
ro: Mega Viaţă

source: Ultra Health
ro: Ultra Viaţă

source: Quad Damage
ro: Putere extremă

source: WarShell
ro: Scut avansat

source: Regeneration
ro: Regenerare

source: Ammo Pack Weak
ro: Cutie cu muniţie inferioară

source: Ammo Pack Strong
ro: Cutie cu muniţie superioară

source: Ammo Pack
ro: Cutie muniţie

source: say:
ro: spune:
