Repository: Picmip/l10n
Catalog: cgame/*.po
Languages: ro

source: You are inside the challengers queue waiting for your turn to play. Use the in-game menu to exit the queue.
ro: Esti in coada competitorilor, asteptandu-ti randul pentru a juca. Foloseste meniul din joc pentru a iesi din coada.

source: no time
ro: nu este timp

source: Time
ro: Timp

source: Name
ro: Nume

source: Score
ro: Scor

source: Racing
ro: Întrecere

source: Spectators
ro: Spectatori

source: Challengers
ro: Competitori

source: Weapon stats
ro: Statistici arme

source: Time:
ro: Timp:

source: Best:
ro: Record:

source: Srv Best:
ro: Record srv:

source: Alpha time:
ro: Timp Alpha:

source: Beta time:
ro: Timp Beta:

source: Picked up:
ro: Utilizări:

source: Points:
ro: Puncte:

source: Download:
ro: Descarcă:

source: Download progress:
ro: Progres transfer:

source: STUNNED
ro: NĂUCIT

source: Personal best:
ro: Record personal:

source: Server record:
ro: Record server:

source: Warmup
ro: Încălzire

source: Low Ammo
ro: Muniţie minimă

source: Out Of Ammo
ro: Muniţie epuizată

source: Waiting for players. 'ESC' for in-game menu.
ro: Sunt aşteptaţi alţi jucători. Apasă 'ESC' ca să deschizi meniul principal.

source: Message of the day:
ro: Anunţul zilei:
